Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_wm_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/supc.h
/**
 * \brief Component description for SUPC
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-01-07T09:41:41Z */
#ifndef _SAMC21_SUPC_COMPONENT_H_
#define _SAMC21_SUPC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SUPC                                         */
/* ************************************************************************** */

/* -------- SUPC_INTENCLR : (SUPC Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define SUPC_INTENCLR_RESETVALUE              _U_(0x00)                                            /**<  (SUPC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SUPC_INTENCLR_BODVDDRDY_Pos           _U_(0)                                               /**< (SUPC_INTENCLR) BODVDD Ready Position */
#define SUPC_INTENCLR_BODVDDRDY_Msk           (_U_(0x1) << SUPC_INTENCLR_BODVDDRDY_Pos)            /**< (SUPC_INTENCLR) BODVDD Ready Mask */
#define SUPC_INTENCLR_BODVDDRDY(value)        (SUPC_INTENCLR_BODVDDRDY_Msk & ((value) << SUPC_INTENCLR_BODVDDRDY_Pos))
#define SUPC_INTENCLR_BODVDDDET_Pos           _U_(1)                                               /**< (SUPC_INTENCLR) BODVDD Detection Position */
#define SUPC_INTENCLR_BODVDDDET_Msk           (_U_(0x1) << SUPC_INTENCLR_BODVDDDET_Pos)            /**< (SUPC_INTENCLR) BODVDD Detection Mask */
#define SUPC_INTENCLR_BODVDDDET(value)        (SUPC_INTENCLR_BODVDDDET_Msk & ((value) << SUPC_INTENCLR_BODVDDDET_Pos))
#define SUPC_INTENCLR_BVDDSRDY_Pos            _U_(2)                                               /**< (SUPC_INTENCLR) BODVDD Synchronization Ready Position */
#define SUPC_INTENCLR_BVDDSRDY_Msk            (_U_(0x1) << SUPC_INTENCLR_BVDDSRDY_Pos)             /**< (SUPC_INTENCLR) BODVDD Synchronization Ready Mask */
#define SUPC_INTENCLR_BVDDSRDY(value)         (SUPC_INTENCLR_BVDDSRDY_Msk & ((value) << SUPC_INTENCLR_BVDDSRDY_Pos))
#define SUPC_INTENCLR_BODCORERDY_Pos          _U_(3)                                               /**< (SUPC_INTENCLR) BODCORE Ready Position */
#define SUPC_INTENCLR_BODCORERDY_Msk          (_U_(0x1) << SUPC_INTENCLR_BODCORERDY_Pos)           /**< (SUPC_INTENCLR) BODCORE Ready Mask */
#define SUPC_INTENCLR_BODCORERDY(value)       (SUPC_INTENCLR_BODCORERDY_Msk & ((value) << SUPC_INTENCLR_BODCORERDY_Pos))
#define SUPC_INTENCLR_BODCOREDET_Pos          _U_(4)                                               /**< (SUPC_INTENCLR) BODCORE Detection Position */
#define SUPC_INTENCLR_BODCOREDET_Msk          (_U_(0x1) << SUPC_INTENCLR_BODCOREDET_Pos)           /**< (SUPC_INTENCLR) BODCORE Detection Mask */
#define SUPC_INTENCLR_BODCOREDET(value)       (SUPC_INTENCLR_BODCOREDET_Msk & ((value) << SUPC_INTENCLR_BODCOREDET_Pos))
#define SUPC_INTENCLR_BCORESRDY_Pos           _U_(5)                                               /**< (SUPC_INTENCLR) BODCORE Synchronization Ready Position */
#define SUPC_INTENCLR_BCORESRDY_Msk           (_U_(0x1) << SUPC_INTENCLR_BCORESRDY_Pos)            /**< (SUPC_INTENCLR) BODCORE Synchronization Ready Mask */
#define SUPC_INTENCLR_BCORESRDY(value)        (SUPC_INTENCLR_BCORESRDY_Msk & ((value) << SUPC_INTENCLR_BCORESRDY_Pos))
#define SUPC_INTENCLR_Msk                     _U_(0x0000003F)                                      /**< (SUPC_INTENCLR) Register Mask  */


/* -------- SUPC_INTENSET : (SUPC Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define SUPC_INTENSET_RESETVALUE              _U_(0x00)                                            /**<  (SUPC_INTENSET) Interrupt Enable Set  Reset Value */

#define SUPC_INTENSET_BODVDDRDY_Pos           _U_(0)                                               /**< (SUPC_INTENSET) BODVDD Ready Position */
#define SUPC_INTENSET_BODVDDRDY_Msk           (_U_(0x1) << SUPC_INTENSET_BODVDDRDY_Pos)            /**< (SUPC_INTENSET) BODVDD Ready Mask */
#define SUPC_INTENSET_BODVDDRDY(value)        (SUPC_INTENSET_BODVDDRDY_Msk & ((value) << SUPC_INTENSET_BODVDDRDY_Pos))
#define SUPC_INTENSET_BODVDDDET_Pos           _U_(1)                                               /**< (SUPC_INTENSET) BODVDD Detection Position */
#define SUPC_INTENSET_BODVDDDET_Msk           (_U_(0x1) << SUPC_INTENSET_BODVDDDET_Pos)            /**< (SUPC_INTENSET) BODVDD Detection Mask */
#define SUPC_INTENSET_BODVDDDET(value)        (SUPC_INTENSET_BODVDDDET_Msk & ((value) << SUPC_INTENSET_BODVDDDET_Pos))
#define SUPC_INTENSET_BVDDSRDY_Pos            _U_(2)                                               /**< (SUPC_INTENSET) BODVDD Synchronization Ready Position */
#define SUPC_INTENSET_BVDDSRDY_Msk            (_U_(0x1) << SUPC_INTENSET_BVDDSRDY_Pos)             /**< (SUPC_INTENSET) BODVDD Synchronization Ready Mask */
#define SUPC_INTENSET_BVDDSRDY(value)         (SUPC_INTENSET_BVDDSRDY_Msk & ((value) << SUPC_INTENSET_BVDDSRDY_Pos))
#define SUPC_INTENSET_BODCORERDY_Pos          _U_(3)                                               /**< (SUPC_INTENSET) BODCORE Ready Position */
#define SUPC_INTENSET_BODCORERDY_Msk          (_U_(0x1) << SUPC_INTENSET_BODCORERDY_Pos)           /**< (SUPC_INTENSET) BODCORE Ready Mask */
#define SUPC_INTENSET_BODCORERDY(value)       (SUPC_INTENSET_BODCORERDY_Msk & ((value) << SUPC_INTENSET_BODCORERDY_Pos))
#define SUPC_INTENSET_BODCOREDET_Pos          _U_(4)                                               /**< (SUPC_INTENSET) BODCORE Detection Position */
#define SUPC_INTENSET_BODCOREDET_Msk          (_U_(0x1) << SUPC_INTENSET_BODCOREDET_Pos)           /**< (SUPC_INTENSET) BODCORE Detection Mask */
#define SUPC_INTENSET_BODCOREDET(value)       (SUPC_INTENSET_BODCOREDET_Msk & ((value) << SUPC_INTENSET_BODCOREDET_Pos))
#define SUPC_INTENSET_BCORESRDY_Pos           _U_(5)                                               /**< (SUPC_INTENSET) BODCORE Synchronization Ready Position */
#define SUPC_INTENSET_BCORESRDY_Msk           (_U_(0x1) << SUPC_INTENSET_BCORESRDY_Pos)            /**< (SUPC_INTENSET) BODCORE Synchronization Ready Mask */
#define SUPC_INTENSET_BCORESRDY(value)        (SUPC_INTENSET_BCORESRDY_Msk & ((value) << SUPC_INTENSET_BCORESRDY_Pos))
#define SUPC_INTENSET_Msk                     _U_(0x0000003F)                                      /**< (SUPC_INTENSET) Register Mask  */


/* -------- SUPC_INTFLAG : (SUPC Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear -------- */
#define SUPC_INTFLAG_RESETVALUE               _U_(0x00)                                            /**<  (SUPC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

