Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_wm_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/supc.h
#define SUPC_BODCORE_ENABLE_Pos               _U_(1)                                               /**< (SUPC_BODCORE) Enable Position */
#define SUPC_BODCORE_ENABLE_Msk               (_U_(0x1) << SUPC_BODCORE_ENABLE_Pos)                /**< (SUPC_BODCORE) Enable Mask */
#define SUPC_BODCORE_ENABLE(value)            (SUPC_BODCORE_ENABLE_Msk & ((value) << SUPC_BODCORE_ENABLE_Pos))
#define SUPC_BODCORE_HYST_Pos                 _U_(2)                                               /**< (SUPC_BODCORE) Hysteresis Enable Position */
#define SUPC_BODCORE_HYST_Msk                 (_U_(0x1) << SUPC_BODCORE_HYST_Pos)                  /**< (SUPC_BODCORE) Hysteresis Enable Mask */
#define SUPC_BODCORE_HYST(value)              (SUPC_BODCORE_HYST_Msk & ((value) << SUPC_BODCORE_HYST_Pos))
#define SUPC_BODCORE_ACTION_Pos               _U_(3)                                               /**< (SUPC_BODCORE) Action when Threshold Crossed Position */
#define SUPC_BODCORE_ACTION_Msk               (_U_(0x3) << SUPC_BODCORE_ACTION_Pos)                /**< (SUPC_BODCORE) Action when Threshold Crossed Mask */
#define SUPC_BODCORE_ACTION(value)            (SUPC_BODCORE_ACTION_Msk & ((value) << SUPC_BODCORE_ACTION_Pos))
#define   SUPC_BODCORE_ACTION_NONE_Val        _U_(0x0)                                             /**< (SUPC_BODCORE) No action  */
#define   SUPC_BODCORE_ACTION_RESET_Val       _U_(0x1)                                             /**< (SUPC_BODCORE) The BODCORE generates a reset  */
#define   SUPC_BODCORE_ACTION_INT_Val         _U_(0x2)                                             /**< (SUPC_BODCORE) The BODCORE generates an interrupt  */
#define SUPC_BODCORE_ACTION_NONE              (SUPC_BODCORE_ACTION_NONE_Val << SUPC_BODCORE_ACTION_Pos) /**< (SUPC_BODCORE) No action Position  */
#define SUPC_BODCORE_ACTION_RESET             (SUPC_BODCORE_ACTION_RESET_Val << SUPC_BODCORE_ACTION_Pos) /**< (SUPC_BODCORE) The BODCORE generates a reset Position  */
#define SUPC_BODCORE_ACTION_INT               (SUPC_BODCORE_ACTION_INT_Val << SUPC_BODCORE_ACTION_Pos) /**< (SUPC_BODCORE) The BODCORE generates an interrupt Position  */
#define SUPC_BODCORE_STDBYCFG_Pos             _U_(5)                                               /**< (SUPC_BODCORE) Configuration in Standby mode Position */
#define SUPC_BODCORE_STDBYCFG_Msk             (_U_(0x1) << SUPC_BODCORE_STDBYCFG_Pos)              /**< (SUPC_BODCORE) Configuration in Standby mode Mask */
#define SUPC_BODCORE_STDBYCFG(value)          (SUPC_BODCORE_STDBYCFG_Msk & ((value) << SUPC_BODCORE_STDBYCFG_Pos))
#define SUPC_BODCORE_RUNSTDBY_Pos             _U_(6)                                               /**< (SUPC_BODCORE) Run during Standby Position */
#define SUPC_BODCORE_RUNSTDBY_Msk             (_U_(0x1) << SUPC_BODCORE_RUNSTDBY_Pos)              /**< (SUPC_BODCORE) Run during Standby Mask */
#define SUPC_BODCORE_RUNSTDBY(value)          (SUPC_BODCORE_RUNSTDBY_Msk & ((value) << SUPC_BODCORE_RUNSTDBY_Pos))
#define SUPC_BODCORE_ACTCFG_Pos               _U_(8)                                               /**< (SUPC_BODCORE) Configuration in Active mode Position */
#define SUPC_BODCORE_ACTCFG_Msk               (_U_(0x1) << SUPC_BODCORE_ACTCFG_Pos)                /**< (SUPC_BODCORE) Configuration in Active mode Mask */
#define SUPC_BODCORE_ACTCFG(value)            (SUPC_BODCORE_ACTCFG_Msk & ((value) << SUPC_BODCORE_ACTCFG_Pos))
#define SUPC_BODCORE_PSEL_Pos                 _U_(12)                                              /**< (SUPC_BODCORE) Prescaler Select Position */
#define SUPC_BODCORE_PSEL_Msk                 (_U_(0xF) << SUPC_BODCORE_PSEL_Pos)                  /**< (SUPC_BODCORE) Prescaler Select Mask */
#define SUPC_BODCORE_PSEL(value)              (SUPC_BODCORE_PSEL_Msk & ((value) << SUPC_BODCORE_PSEL_Pos))
#define   SUPC_BODCORE_PSEL_DIV2_Val          _U_(0x0)                                             /**< (SUPC_BODCORE) Divide clock by 2  */
#define   SUPC_BODCORE_PSEL_DIV4_Val          _U_(0x1)                                             /**< (SUPC_BODCORE) Divide clock by 4  */
#define   SUPC_BODCORE_PSEL_DIV8_Val          _U_(0x2)                                             /**< (SUPC_BODCORE) Divide clock by 8  */
#define   SUPC_BODCORE_PSEL_DIV16_Val         _U_(0x3)                                             /**< (SUPC_BODCORE) Divide clock by 16  */
#define   SUPC_BODCORE_PSEL_DIV32_Val         _U_(0x4)                                             /**< (SUPC_BODCORE) Divide clock by 32  */
#define   SUPC_BODCORE_PSEL_DIV64_Val         _U_(0x5)                                             /**< (SUPC_BODCORE) Divide clock by 64  */
#define   SUPC_BODCORE_PSEL_DIV128_Val        _U_(0x6)                                             /**< (SUPC_BODCORE) Divide clock by 128  */
#define   SUPC_BODCORE_PSEL_DIV256_Val        _U_(0x7)                                             /**< (SUPC_BODCORE) Divide clock by 256  */
#define   SUPC_BODCORE_PSEL_DIV512_Val        _U_(0x8)                                             /**< (SUPC_BODCORE) Divide clock by 512  */
#define   SUPC_BODCORE_PSEL_DIV1024_Val       _U_(0x9)                                             /**< (SUPC_BODCORE) Divide clock by 1024  */
#define   SUPC_BODCORE_PSEL_DIV2048_Val       _U_(0xA)                                             /**< (SUPC_BODCORE) Divide clock by 2048  */
#define   SUPC_BODCORE_PSEL_DIV4096_Val       _U_(0xB)                                             /**< (SUPC_BODCORE) Divide clock by 4096  */
#define   SUPC_BODCORE_PSEL_DIV8192_Val       _U_(0xC)                                             /**< (SUPC_BODCORE) Divide clock by 8192  */
#define   SUPC_BODCORE_PSEL_DIV16384_Val      _U_(0xD)                                             /**< (SUPC_BODCORE) Divide clock by 16384  */
#define   SUPC_BODCORE_PSEL_DIV32768_Val      _U_(0xE)                                             /**< (SUPC_BODCORE) Divide clock by 32768  */
#define   SUPC_BODCORE_PSEL_DIV65536_Val      _U_(0xF)                                             /**< (SUPC_BODCORE) Divide clock by 65536  */
#define SUPC_BODCORE_PSEL_DIV2                (SUPC_BODCORE_PSEL_DIV2_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 2 Position  */
#define SUPC_BODCORE_PSEL_DIV4                (SUPC_BODCORE_PSEL_DIV4_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 4 Position  */
#define SUPC_BODCORE_PSEL_DIV8                (SUPC_BODCORE_PSEL_DIV8_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 8 Position  */
#define SUPC_BODCORE_PSEL_DIV16               (SUPC_BODCORE_PSEL_DIV16_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 16 Position  */
#define SUPC_BODCORE_PSEL_DIV32               (SUPC_BODCORE_PSEL_DIV32_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 32 Position  */
#define SUPC_BODCORE_PSEL_DIV64               (SUPC_BODCORE_PSEL_DIV64_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 64 Position  */
#define SUPC_BODCORE_PSEL_DIV128              (SUPC_BODCORE_PSEL_DIV128_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 128 Position  */
#define SUPC_BODCORE_PSEL_DIV256              (SUPC_BODCORE_PSEL_DIV256_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 256 Position  */
#define SUPC_BODCORE_PSEL_DIV512              (SUPC_BODCORE_PSEL_DIV512_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 512 Position  */
#define SUPC_BODCORE_PSEL_DIV1024             (SUPC_BODCORE_PSEL_DIV1024_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 1024 Position  */
#define SUPC_BODCORE_PSEL_DIV2048             (SUPC_BODCORE_PSEL_DIV2048_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 2048 Position  */
#define SUPC_BODCORE_PSEL_DIV4096             (SUPC_BODCORE_PSEL_DIV4096_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 4096 Position  */
#define SUPC_BODCORE_PSEL_DIV8192             (SUPC_BODCORE_PSEL_DIV8192_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 8192 Position  */
#define SUPC_BODCORE_PSEL_DIV16384            (SUPC_BODCORE_PSEL_DIV16384_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 16384 Position  */
#define SUPC_BODCORE_PSEL_DIV32768            (SUPC_BODCORE_PSEL_DIV32768_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 32768 Position  */
#define SUPC_BODCORE_PSEL_DIV65536            (SUPC_BODCORE_PSEL_DIV65536_Val << SUPC_BODCORE_PSEL_Pos) /**< (SUPC_BODCORE) Divide clock by 65536 Position  */
#define SUPC_BODCORE_LEVEL_Pos                _U_(16)                                              /**< (SUPC_BODCORE) Threshold Level Position */
#define SUPC_BODCORE_LEVEL_Msk                (_U_(0x3F) << SUPC_BODCORE_LEVEL_Pos)                /**< (SUPC_BODCORE) Threshold Level Mask */
#define SUPC_BODCORE_LEVEL(value)             (SUPC_BODCORE_LEVEL_Msk & ((value) << SUPC_BODCORE_LEVEL_Pos))
#define SUPC_BODCORE_Msk                      _U_(0x003FF17E)                                      /**< (SUPC_BODCORE) Register Mask  */


/* -------- SUPC_VREG : (SUPC Offset: 0x18) (R/W 32) VREG Control -------- */
#define SUPC_VREG_RESETVALUE                  _U_(0x00)                                            /**<  (SUPC_VREG) VREG Control  Reset Value */

